<?php
/**
 * 公共语言包
 */
return [
	'200'		=> '执行成功',
	'0x000000'	=> '请求成功',
	'0x000001'	=> '缺少必填项',
	'0x000002'	=> '没有数据返回',
	'0x000003'	=> '未知错误',
	'0x000004'	=> '部分更新失败',
	'0x000005'	=> '部分删除失败',
	'0x000006'	=> '没有权限',
	'0x000007'  => '字段{field}不合法',
	'0x000008'  => '提交字段不合法',
	'0x000009'  => 'IP受限制',
	'0x000010'  => '缺少配置文件',
	'0x000011'  => '导入数据不匹配',
	'0x000012'  => '测试失败！',
	'0x000013'  => 'API错误',
	'0x000014'  => '没有提交SQL语句！',
	'0x000015'  => 'SQL语句包含非法关键字！',
	'0x000016'  => 'SQL语句错误',
	'0x000014'  => '允许访问菜单必须是数组',
	'0x000017'  => '没有操作权限',
	'0x000018'  => '请求失败',
	'0x000019'  => '缺少Url地址',
	'0x000020'  => '数据已存在,不需要新增',
	'0x000021'  => '数据不存在,无法更新',
	'0x000022'  => '文件错误',
];